УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="07a989fe-b7de-44b6-839d-e1cce1d2d423">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4b318cc3-2f5c-4b35-9733-92b8480d218b">
    <name>смартЛогинНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45c407b4-0b68-47cd-a142-a06f4a184f90">
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67d2f639-09f9-487b-aefa-c42471c9026b">
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1507bf85-d479-4d4c-b34f-ae3f3fbe92d0">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/Forms/CRM_ФормаБыстрогоВвода/Module.bsl
#Область ПеренесеноСДоработками

//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ПараметрыНового") Тогда
		Если Параметры.ПараметрыНового.Свойство("ЭтоКонтактныйКлиент") И Параметры.ПараметрыНового.ЭтоКонтактныйКлиент = Истина Тогда
			Заголовок						= НСтр("ru='Регистрация новой связи с юридическим лицом';en='Logging of new communication with the legal entity'");
			Элементы.ГруппаСтраниц.ТекущаяСтраница	= Элементы.СтраницаКонтактногоКлиента;
			ЭтоКонтактныйКлиент						= Параметры.ПараметрыНового.ЭтоКонтактныйКлиент;
			КонтактныйКлиент						= Параметры.ПараметрыНового.КонтактныйКлиент;
			Состояние								= Перечисления.CRM_Состояние.Работает;
			ЗаполнитьПоФизЛицу();
		Иначе
			Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.СтраницаКонтактногоЛица;
			Наименование			= Параметры.ПараметрыНового.Наименование;
			ВидEmailКонтактногоЛица	= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
			EmailКонтактногоЛица	= Параметры.ПараметрыНового.АдресПочты;
		КонецЕсли;
	КонецЕсли;
	// +Софтфон
	Если Параметры.Свойство("Основание") И ТипЗнч(Параметры.Основание) = Тип("Структура") Тогда
		Если Параметры.Основание.Свойство("Интерес") Тогда
			сфпИнтерес = Параметры.Основание.Интерес;
		КонецЕсли;	
		Клиент = ?(Параметры.Основание.Свойство("Владелец"),Параметры.Основание.Владелец, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		Если Параметры.Основание.Свойство("НомерТелефона") Тогда
			Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Параметры.Основание.НомерТелефона);		
			СтруктураНомера = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Телефон);
			Если Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
				ВидТелефонаКонтактногоЛица = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица");
			Иначе	
				ВидТелефонаКонтактногоЛица = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица");
			КонецЕсли;			
			Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
				КодГородаКонтактногоЛица = СтруктураНомера.КодГорода;
			КонецЕсли;	
			Если ЗначениеЗаполнено(СтруктураНомера.КодСтраны) Тогда
				КодСтраныКонтактногоЛица = СтруктураНомера.КодСтраны;
			КонецЕсли;				
			ТелефонКонтактногоЛица = СтруктураНомера.НомерТелефона;
		КонецЕсли;					
	КонецЕсли;		
	// +Софтфон

 	#Вставка
	//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
	ЭтаФорма.Элементы.ТелефонКонтактногоЛица.УстановитьДействие("ПриИзменении", "смартПриИзмененииТелефона"); 
	//-- #1152 смарт: Лопато 18.10.2024
	#КонецВставки
	
КонецПроцедуры

//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
&НаКлиенте
&ИзменениеИКонтроль("EmailКонтактногоЛицаПриИзменении")
Процедура смарт_EmailКонтактногоЛицаПриИзменении(Элемент)

	РезультатПроверки = CRM_ОбщегоНазначенияКлиентСервер.АнализАдресаЭП(СокрЛП(Элемент.ТекстРедактирования));
	Если РезультатПроверки.КодОшибки<>0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.Сообщение, , Элемент.Имя);
	КонецЕсли;

	#Вставка
	//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
	смартОбщегоНазначенияКлиент.ПроверитьПочтуПриИзменении(
		Элемент, ПредопределенноеЗначение("Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка"), ЭтаФорма);
	//-- #1152 смарт: Лопато 18.10.2024
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
&НаКлиенте
Процедура смартПриИзмененииТелефона(Элемент) // можно вводить только цифры
		
	Строка = СокрЛП(Элемент.ТекстРедактирования);
	
	СтрокаТелефон = СокрЛП(ЭтотОбъект["КодСтраныКонтактногоЛица"])
				  + СокрЛП(ЭтотОбъект["КодГородаКонтактногоЛица"])
				  + СокрЛП(ЭтотОбъект["ТелефонКонтактногоЛица"]);
	
	СтруктураПроверки = Новый Структура;
	
	СтруктураПроверки.Вставить("Значение", 		"");
	СтруктураПроверки.Вставить("Представление", СтрокаТелефон);
	СтруктураПроверки.Вставить("Владелец", 		Неопределено);
	СтруктураПроверки.Вставить("Ссылка", ПредопределенноеЗначение("Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка"));
	
	ИтогПроверки = смартОбщегоНазначения.ПроверитьТелефон(СтруктураПроверки); 
	
	Если ИтогПроверки.КодОшибки <> 0 Тогда

		ОчиститьСообщения();

		Если ИтогПроверки.КодОшибки = 12 И ИтогПроверки.Свойство("МассивДублей") Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
			
			Для Каждого ЭлементДубль Из ИтогПроверки.МассивДублей Цикл
				ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементДубль.ТекстСообщения, ЭлементДубль.Ключ);
			КонецЦикла;
			
		Иначе	

			ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
			
		КонецЕсли;

		ЭтотОбъект["КодСтраныКонтактногоЛица"] = "";
		ЭтотОбъект["КодГородаКонтактногоЛица"] = "";
		ЭтотОбъект["ТелефонКонтактногоЛица"] = "";
		
	КонецЕсли;
	
КонецПроцедуры //-- #1152 смарт: Лопато 18.10.2024

#КонецОбласти
